quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Что из перечисленного является языком разметки для веб-страниц?',
        'options': ['HTML', 'CSS', 'JavaScript', 'Python'],
        'correct_option': 0
    },
    {
        'question': 'Какой оператор используется для выполнения целочисленного деления в Python?',
        'options': ['//', '/', '%', '**'],
        'correct_option': 0
    },
    {
        'question': 'Какая структура данных используется для хранения элементов в порядке, в котором они были добавлены?',
        'options': ['Список', 'Множество', 'Словарь', 'Кортеж'],
        'correct_option': 0
    },
    {
        'question': 'Какая функция используется для получения длины списка в Python?',
        'options': ['len()', 'count()', 'size()', 'length()'],
        'correct_option': 0
    },
    {
        'question': 'Какой цикл используется для перебора элементов в списке в Python?',
        'options': ['for', 'while', 'do-while', 'loop'],
        'correct_option': 0
    },
    {
        'question': 'Что такое IDE в контексте программирования?',
        'options': ['Интегрированная среда разработки', 'Интернет-движок', 'Интерфейс базы данных', 'Индекс документов исходного кода'],
        'correct_option': 0
    },
    {
        'question': 'Какой метод используется для добавления элемента в конец списка в Python?',
        'options': ['append()', 'insert()', 'extend()', 'add()'],
        'correct_option': 0
    },
    {
        'question': 'Какой символ используется для обозначения однострочного комментария в Python?',
        'options': ['#', '//', '/*', '\'\'\''],
        'correct_option': 0
    },
]